bench/custom/logs/fuse/ramdisk/origin1/fuse_write_0-1.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=164597: Thu May 30 08:31:24 2024
  write: IOPS=235k, BW=917MiB/s (962MB/s)(32.0GiB/35723msec); 0 zone resets
    clat (usec): min=11, max=144249, avg=132.04, stdev=163.59
     lat (usec): min=11, max=144249, avg=132.13, stdev=164.14
    clat percentiles (usec):
     |  1.00th=[   27],  5.00th=[   73], 10.00th=[   91], 20.00th=[  105],
     | 30.00th=[  115], 40.00th=[  123], 50.00th=[  130], 60.00th=[  139],
     | 70.00th=[  149], 80.00th=[  161], 90.00th=[  178], 95.00th=[  194],
     | 99.00th=[  229], 99.50th=[  245], 99.90th=[  302], 99.95th=[  367],
     | 99.99th=[  734]
   bw (  KiB/s): min=790488, max=1926017, per=100.00%, avg=958492.44, stdev=5522.55, samples=2205
   iops        : min=197622, max=481504, avg=239622.86, stdev=1380.63, samples=2205
  lat (usec)   : 20=0.34%, 50=2.66%, 100=13.07%, 250=83.53%, 500=0.38%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.87%, sys=5.54%, ctx=8407948, majf=0, minf=304
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=917MiB/s (962MB/s), 917MiB/s-917MiB/s (962MB/s-962MB/s), io=32.0GiB (34.4GB), run=35723-35723msec