bench/custom/logs/fuse/ramdisk/origin1/fuse_write_0-3.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=164711: Thu May 30 08:34:05 2024
  write: IOPS=338k, BW=1319MiB/s (1384MB/s)(32.0GiB/24834msec); 0 zone resets
    clat (usec): min=11, max=69013, avg=89.14, stdev=149.77
     lat (usec): min=12, max=69013, avg=89.21, stdev=149.86
    clat percentiles (usec):
     |  1.00th=[   21],  5.00th=[   39], 10.00th=[   55], 20.00th=[   68],
     | 30.00th=[   75], 40.00th=[   82], 50.00th=[   89], 60.00th=[   95],
     | 70.00th=[  102], 80.00th=[  111], 90.00th=[  124], 95.00th=[  137],
     | 99.00th=[  165], 99.50th=[  178], 99.90th=[  221], 99.95th=[  281],
     | 99.99th=[ 1123]
   bw (  MiB/s): min=  943, max= 2498, per=100.00%, avg=1374.65, stdev= 9.75, samples=1485
   iops        : min=241572, max=639564, avg=351910.67, stdev=2495.22, samples=1485
  lat (usec)   : 20=0.88%, 50=7.91%, 100=59.15%, 250=32.00%, 500=0.04%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=1.14%, sys=11.78%, ctx=8405650, majf=0, minf=276
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1319MiB/s (1384MB/s), 1319MiB/s-1319MiB/s (1384MB/s-1384MB/s), io=32.0GiB (34.4GB), run=24834-24834msec