bench/custom/logs/fuse/ramdisk/origin1/fuse_write_0-31.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=206888: Thu May 30 08:41:39 2024
  write: IOPS=604k, BW=2360MiB/s (2475MB/s)(32.0GiB/13882msec); 0 zone resets
    clat (usec): min=12, max=4711, avg=51.82, stdev=16.66
     lat (usec): min=12, max=4711, avg=51.96, stdev=16.66
    clat percentiles (usec):
     |  1.00th=[   36],  5.00th=[   39], 10.00th=[   40], 20.00th=[   42],
     | 30.00th=[   44], 40.00th=[   45], 50.00th=[   47], 60.00th=[   50],
     | 70.00th=[   55], 80.00th=[   62], 90.00th=[   71], 95.00th=[   78],
     | 99.00th=[  108], 99.50th=[  125], 99.90th=[  172], 99.95th=[  196],
     | 99.99th=[  269]
   bw (  MiB/s): min= 1958, max= 2645, per=100.00%, avg=2372.91, stdev= 6.73, samples=864
   iops        : min=501260, max=677158, avg=607465.93, stdev=1722.98, samples=864
  lat (usec)   : 20=0.02%, 50=61.69%, 100=36.90%, 250=1.37%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=3.50%, sys=16.09%, ctx=8389076, majf=0, minf=553
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2360MiB/s (2475MB/s), 2360MiB/s-2360MiB/s (2475MB/s-2475MB/s), io=32.0GiB (34.4GB), run=13882-13882msec