bench/custom/logs/fuse/ramdisk/origin1/fuse_write_0-7.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=164862: Thu May 30 08:36:34 2024
  write: IOPS=635k, BW=2481MiB/s (2601MB/s)(32.0GiB/13209msec); 0 zone resets
    clat (usec): min=11, max=3510, avg=46.64, stdev=13.99
     lat (usec): min=12, max=3510, avg=46.72, stdev=14.00
    clat percentiles (usec):
     |  1.00th=[   22],  5.00th=[   32], 10.00th=[   35], 20.00th=[   38],
     | 30.00th=[   40], 40.00th=[   42], 50.00th=[   44], 60.00th=[   47],
     | 70.00th=[   50], 80.00th=[   56], 90.00th=[   64], 95.00th=[   71],
     | 99.00th=[   89], 99.50th=[  100], 99.90th=[  137], 99.95th=[  157],
     | 99.99th=[  223]
   bw (  MiB/s): min= 2426, max= 3251, per=100.00%, avg=2619.48, stdev= 6.51, samples=775
   iops        : min=621153, max=832256, avg=670587.29, stdev=1665.88, samples=775
  lat (usec)   : 20=0.78%, 50=69.15%, 100=29.57%, 250=0.50%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=3.18%, sys=16.03%, ctx=8435939, majf=0, minf=283
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2481MiB/s (2601MB/s), 2481MiB/s-2481MiB/s (2601MB/s-2601MB/s), io=32.0GiB (34.4GB), run=13209-13209msec