bench/custom/logs/fuse/ramdisk/origin1/fuse_write_0.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=164459: Thu May 30 08:28:31 2024
  write: IOPS=126k, BW=492MiB/s (516MB/s)(32.0GiB/66582msec); 0 zone resets
    clat (usec): min=10, max=47545, avg=251.90, stdev=140.07
     lat (usec): min=10, max=47545, avg=251.99, stdev=140.93
    clat percentiles (usec):
     |  1.00th=[  122],  5.00th=[  186], 10.00th=[  200], 20.00th=[  217],
     | 30.00th=[  229], 40.00th=[  239], 50.00th=[  249], 60.00th=[  260],
     | 70.00th=[  269], 80.00th=[  285], 90.00th=[  310], 95.00th=[  334],
     | 99.00th=[  388], 99.50th=[  416], 99.90th=[  506], 99.95th=[  562],
     | 99.99th=[  848]
   bw (  KiB/s): min=482912, max=744050, per=100.00%, avg=505544.32, stdev=787.70, samples=4214
   iops        : min=120728, max=186010, avg=126385.99, stdev=196.92, samples=4214
  lat (usec)   : 20=0.17%, 50=0.56%, 100=0.18%, 250=49.79%, 500=49.20%
  lat (usec)   : 750=0.10%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=0.50%, sys=2.64%, ctx=8403257, majf=0, minf=300
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=492MiB/s (516MB/s), 492MiB/s-492MiB/s (516MB/s-516MB/s), io=32.0GiB (34.4GB), run=66582-66582msec